app/Controllers/User.php

    public function update($uname = null){
        $data = $this->request->getRawInput();
        $data['username'] = $uname;

        $isExists = $this->model->where('username', $uname)->findAll();

        if(!$isExists){
            return $this->failNotFound("Data tidak ditemukan");
        }else{
            $data['id_user'] = $isExists[0]['id_user'];
        }

        if(!$this->model->save($data)){ // Kalau ada error saat menyimpan
---
UPDATE `user` SET `first_name` = 'Reiki', `last_name` = 'Savian', `username` = 'reiki'
WHERE `user`.`id_user` IN ('5')